Repository: Bytestorm5/Al-Asl-TempLanding
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ur

source: Invalid email address. Please try again.
ur: ای میل ایڈریس درست نہیں ہے۔ براہ کرم دوبارہ کوشش کریں۔

source: Successfully added to the waitlist!
ur: ویٹ لسٹ میں کامیابی سے شامل کر لیا گیا!

source: An error occurred: {error}
ur: ایک خرابی پیش آئی: {error}

source: Logo
ur: لوگو

source: The Urdu Chapter of Azharul Jannah
ur: ازہار الجنۃ کی اردو شاخ

source: Switch to Urdu
ur: اردو میں تبدیل کریں

source: Do you not see how Allah compares a good word to a good tree? Its root is firm and its branches reach the sky
ur: کیا تم دیکھتے نہیں ہو کہ اللہ نے کلمہ طیّبہ کو کس چیز سے مثال دی ہے؟ اِس کی مثال ایسی ہے جیسے ایک اچھی ذات کا درخت جس کی جڑ زمین میں گہری جمی ہوئی ہے اور شاخیں آسمان تک پہنچی ہوئی ہیں

source: Subscribe Now
ur: ابھی سبسکرائب کریں

source: Join our WhatsApp Channel
ur: ہمارے واٹس ایپ چینل میں شامل ہوں

source: Our Courses
ur: ہمارے کورسز

source: Book Club
ur: بزمِ مطالعہ

source: Sisters Book Club, Bazm-e-Mutalia’, is a unique platform for Urdu-speaking sisters where they can nurture their love for knowledge and literature through books. This reading circle provides not only an opportunity for intellectual discussions but also a beautiful chance to delve into the depths of religion and literature.
ur: بزمِ مطالعہ اردو زبان بولنے والی بہنوں کے لیے ایک منفرد پلیٹ فارم ہے جہاں وہ کتابوں کے ذریعے علم و ادب سے محبت کو فروغ دے سکتی ہیں۔ یہ حلقہ مطالعہ نہ صرف علمی گفتگو بلکہ دین اور ادب کی گہرائیوں کو سمجھنے کے لیے ایک خوبصورت موقع فراہم کرتا ہے۔

source: Coming Soon
ur: جلد آ رہا ہے

source: Akhlaq Hamlatul Quran
ur: اخلاق حملۃ القرآن

source: This book reading session delves into the profound teachings of the book Akhlaq Hamlatul Quran, emphasizing the moral and spiritual qualities essential for those who engage with the Quran. Students will explore the etiquettes, responsibilities, and character traits that align with carrying, understanding, and living by the Quranic message. Ideal for those seeking to enhance their relationship with the Quran.
ur: یہ کتاب خوانی کا سیشن کتاب "اخلاق حملۃ القرآن" کی گہری تعلیمات پر روشنی ڈالتا ہے، جو قرآن سے تعلق رکھنے والوں کے لیے ضروری اخلاقی اور روحانی خصوصیات کو اجاگر کرتا ہے۔ طلبہ اس کورس میں ان آداب، ذمہ داریوں اور کردار کی خصوصیات کو سمجھیں گے جو قرآن کے پیغام کو اپنانے، سمجھنے اور اس کے مطابق زندگی گزارنے کے لیے لازم ہیں۔ یہ کورس ان لوگوں کے لیے بہترین ہے جو قرآن کے ساتھ اپنے تعلق کو مضبوط بنانا چاہتے ہیں۔

source: Quran and Tajweed
ur: تجوید اور قرآن

source: Al-Asl plans to offer a range of Tajweed and Quran courses in Urdu, adapted from Azharul Jannah in English, by the teachers trained under the guidance of Ustadha Zahara Ahamath. By learning in their native language, sisters can connect more profoundly with the Quranic message while mastering the techniques of proper recitation.
ur: الاصل ایک وسیع رینج کے تجوید اور قرآن کورسز اردو زبان میں پیش کرنے کا ارادہ رکھتا ہے، جو انگلش میں "ازہار الجنة" کے کورسز سے ماخوذ ہوں گے۔ یہ کورسز استاذہ زہرہ احمد کی رہنمائی میں تربیت یافتہ اساتذہ کے ذریعے فراہم کیے جائیں گے۔ اپنی مادری زبان میں تعلیم حاصل کرکے، بہنیں قرآن کے پیغام سے زیادہ گہرائی کے ساتھ جڑ سکیں گی اور درست تلاوت کے طریقے کو مہارت کے ساتھ سیکھ سکیں گی۔

source: About Us
ur: ألأصل کے بارے میں

source: Welcome to ألأصل, an institute dedicated to rediscovering the roots of our faith and culture through the language of Urdu. Inspired by the profound message in Surah Ibrahim (14:24), where a "good word" is likened to a tree with firm roots and flourishing branches, ألأصل aims to nurture a deep and lasting connection to the Quran and Islamic teachings.
ur: ألأصل میں خوش آمدید! سورہ ابراہیم میں اللہ تعالیٰ نے پاکیزہ کلمے کی مثال ایک ایسے درخت سے دی ہے جس کی جڑیں مضبوط ہیں اور جس کی شاخیں آسمان تک پھیلی ہوئی ہیں۔ اسی خوبصورت تشبیہ سے رہنمائی لیتے ہوئے، ألأصل کا مقصد اپنى بہنوں کو علم اور ایمان کی ان جڑوں سے جوڑنا ہے جو ہماری زبان، ثقافت اور قرآن سے وابستہ ہیں۔

source: At ألأصل, we believe that to truly understand Islam, one must begin with its foundations. While Arabic is the primary language of the Quran, Urdu holds a unique and rich position in the Islamic world. After Arabic, Urdu is the language in which the most books, commentaries, and resources on Islam and the Quran have been written. It serves as a bridge for countless individuals seeking to explore and immerse themselves in the teachings of Islam.
ur: ألأصل کا مطلب ہے "جڑیں"، اور ہمارا یہ ادارہ اس نام کو حقیقت میں بدلنے کے لیے وقف ہے۔ ہمارا یقین ہے کہ اسلام کو صحیح طور پر سمجھنے کے لیے ضروری ہے کہ اس کی بنیادوں کو مضبوط کیا جائے۔ عربی قرآن کی اصل زبان ہے، لیکن اردو نے اسلامی دنیا میں علم اور ادب کی ترویج میں ایک لازوال کردار ادا کیا ہے۔ عربی کے بعد سب سے زیادہ اسلامی کتب، تفاسیر، اور علوم اردو میں دستیاب ہیں، اور کئی خطوں میں لوگ اسلام کو سیکھنے سے پہلے اردو سیکھتے ہیں۔

source: Our mission is to go back to the roots and provide a platform for individuals to study and appreciate the beauty of the Quran, Hadith, and Islamic literature through Urdu. We cater to people from all walks of life, particularly those who wish to strengthen their understanding of Islam through Urdu language. From beginners to advanced learners, we offer courses that are tailored to different levels of proficiency.
ur: ہمارا مشن یہ ہے کہ اردو زبان کے ذریعے قرآن، حدیث، اور اسلامی علوم کی خوبصورتی اور گہرائی کو دنیا بھر کے لوگوں تک پہنچایا جائے۔ ہم ایسے کورسز پیش کرتے ہیں جو ابتدائی سطح کے طلباء سے لے کر ماہرین تک، ہر ایک کی ضروریات کو پورا کرتے ہیں۔ ہمارا مقصد اردو زبان سکھانا نہیں بلکہ اردو کے ذريعے قرآن اور اسلامی روایات کے ساتھ ایک گہرا تعلق پیدا کرنا ہے۔

source: Our Vision
ur: ہمارا وژن

source: Our vision is to create a world where the roots of faith and knowledge are accessible to everyone. By empowering individuals with the tools to study the Quran and Islamic texts in Urdu, we aspire to revive the love for learning and understanding Islam in its truest form.
ur: ہمارا وژن ایک ایسی دنیا کی تخلیق ہے جہاں ہر شخص علم اور ایمان کی جڑوں تک رسائی حاصل کر سکے۔ ہم اردو کے ذریعے اسلامی متون اور قرآن کے مطالعے کو فروغ دے کر اسلام کی حقیقی تعلیمات کو سمجھنے اور سیکھنے کا جذبہ پیدا کرنا چاہتے ہیں۔

source: About the Founder
ur: بانی کے بارے میں

source: Naila Firdaus, the founder of Al-Asl (ألأصل), is a passionate learner and educator committed to spreading Islamic knowledge to Urdu-speaking audiences. She holds a Bachelor’s degree in Computer Science and a Master’s degree in Project Management and has been an IT professional in New Jersey since 1999.
ur: نائلہ فردوس، الاصل کی بانی، ایک شوقین طالبہ اور معلمہ ہیں جو اردو بولنے والوں تک اسلامی علم کو پہنچانے کے لیے پرعزم ہیں۔ وہ کمپیوٹر سائنس میں بیچلرز اور پروجیکٹ مینجمنٹ میں ماسٹرز کی ڈگری رکھتی ہیں اور 1999 سے نیو جرسی میں بطور آئی ٹی پروفیشنل کام کر رہی ہیں۔

source: Her journey into Islamic studies began after a heartfelt dua during Hajj, inspiring her to pursue advanced Quranic education. She has studied Ashara Sughra under multiple Shuyukh, holds Ijazat in various Mutoon, and is currently pursuing a PhD in Quranic Sciences.
ur: ان کی دینی تعلیم کا سفر حج کے دوران کی گئی ایک دعا سے شروع ہوا، جس نے انہیں قرآن کے علم کو گہرائی سے سیکھنے کی ترغیب دی۔ نائلہ نے مختلف شیوخ کے ساتھ عشرہ صغریٰ کا مطالعہ کیا ہے، متعدد متون میں اجازات حاصل کی ہیں، اور اس وقت قرآنی علوم میں پی ایچ ڈی کر رہی ہیں۔

source: With a vision to make Islamic education accessible, Naila established Al-Asl, a platform dedicated to teaching Quranic recitation, Tajweed, and the etiquettes of Ahlul Quran. Her work reflects her dedication to creating a safe space for Urdu speakers to connect with the Quran and its teachings.
ur: اسلامی تعلیمات کو عام کرنے کے عزم کے ساتھ، نائلہ نے الاصل (ألأصل) کا قیام کیا، جو قرآن کی تلاوت، تجوید، اور اہل القرآن کے آداب سیکھنے کے لیے ایک محفوظ اور قابل رسائی پلیٹ فارم فراہم کرتا ہے۔ ان کی محنت اردو بولنے والوں کو قرآن اور اس کی تعلیمات سے جڑنے کا ایک خوبصورت ذریعہ فراہم کرتی ہے۔

source: Join Us!
ur: ہم سے جڑیں!

source: Subscribe to get notified about updates to Al-Asl, or join our WhatsApp Channel!
ur: الاصل کی تازہ ترین معلومات کے لیے سبسکرائب کریں یا ہمارے واٹس ایپ چینل میں شامل ہوں!

source: First Name
ur: پہلا نام

source: Last Name
ur: آخری نام

source: Email
ur: ای میل
